---
kind: enumMember
id: F:Autodesk.Revit.DB.ExportRange.VisibleRegionOfCurrentView
enum: Autodesk.Revit.DB.ExportRange
source: html/a0e98f2d-3da3-c6bb-a27e-7460f7293781.htm
---
# Autodesk.Revit.DB.ExportRange.VisibleRegionOfCurrentView

Export the visible region of the current view.